// Lab_03_4.cpp
// < Пушкаш Максим >
// Лабораторна робота № 3.4
// Розгалуження, задане плоскою фігурою.
// Варіант 11



#include <iostream>
#include <cmath> 

using namespace std;

int main() {
    double x, y, R;

    
    cout << "Введіть координати точки (x, y): ";
    cin >> x >> y;
    cout << "Введіть значення радіуса R: ";
    cin >> R;

    
    if (x >= 0 && y >= 0 && (pow(x, 2) + pow(y, 2) <= pow(R, 2))) {
        cout << "Точка належить до зафарбованої області (чверть кола)." << endl;
    }
    
    else if (x <= 0 && y <= 0 && y >= x) {
        cout << "Точка належить до зафарбованої області (трикутник)." << endl;
    }
    
    else {
        cout << "Точка не належить до зафарбованої області." << endl;
    }

    return 0;
}


